app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "knightnit96@gmail.com"], ["LIMIT", 1]]
---
  def edit
    user = User.find_by email: params[:email]