app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "knightnit96@gmail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by email: params[:password_reset][:email].downcase

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$pDPB1t2uCbx32i3.qZSPH.7eNK05ZWfQDDmHNPRdhwr.IgQ4EqDBy"], ["updated_at", "2019-05-24 06:28:01.064164"], ["id", 102]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add :password, t("controllers.password_resets.not_empty")
      render :edit
    elsif @user.update_attributes user_params

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "knightnit96@gmail.com"], ["LIMIT", 1]]
---
  def get_user
    @user = User.find_by email: params[:email]