app/controllers/sessions_controller.rb

  def create
    @user = User.find_by email: params[:session][:email].downcase
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nguyen.hoang.thuan@sun-asterisk.com"], ["LIMIT", 1]]