app/controllers/users_controller.rb

  def index
    @users = User.activated.paginate(page: params[:page], per_page:
      Settings.per_page)
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes user_params
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$CrFv5MCr1dDwCsysdmmNCOPHvpKr5pdmUaCJRUjUcAiP4MRPcE7ay"], ["updated_at", "2019-05-24 02:47:12.713014"], ["id", 102]]

  def find_user
    @user = User.find_by id: params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]